export function getBet(letter: string): string[] | null {
  letter = letter.charCodeAt(0).toString(16).toUpperCase();
  if (letter >= '1200' && letter <= '1207') {
    return ['ሀ', 'ሁ', 'ሂ', 'ሃ', 'ሄ', 'ህ', 'ሆ', 'ሇ'];
  }
  if (letter >= '1208' && letter <= '120F') {
    return ['ለ', 'ሉ', 'ሊ', 'ላ', 'ሌ', 'ል', 'ሎ', 'ሏ'];
  }
  if (letter >= '1210' && letter <= '1217') {
    return ['ሐ', 'ሑ', 'ሒ', 'ሓ', 'ሔ', 'ሕ', 'ሖ', 'ሗ'];
  }
  if (letter >= '1218' && letter <= '121F') {
    return ['መ', 'ሙ', 'ሚ', 'ማ', 'ሜ', 'ም', 'ሞ', 'ሟ'];
  }
  if (letter >= '1220' && letter <= '1227') {
    return ['ሠ', 'ሡ', 'ሢ', 'ሣ', 'ሤ', 'ሥ', 'ሦ', 'ሧ'];
  }
  if (letter >= '1228' && letter <= '122F') {
    return ['ረ', 'ሩ', 'ሪ', 'ራ', 'ሬ', 'ር', 'ሮ', 'ሯ'];
  }
  if (letter >= '1230' && letter <= '1237') {
    return ['ሰ', 'ሱ', 'ሲ', 'ሳ', 'ሴ', 'ስ', 'ሶ', 'ሷ'];
  }
  if (letter >= '1238' && letter <= '123F') {
    return ['ሸ', 'ሹ', 'ሺ', 'ሻ', 'ሼ', 'ሽ', 'ሾ', 'ሿ'];
  }
  if (letter >= '1240' && letter <= '124F') {
    return ['ቀ', 'ቁ', 'ቂ', 'ቃ', 'ቄ', 'ቅ', 'ቆ', 'ቇ', 'ቈ', 'ቊ', 'ቋ', 'ቌ', 'ቍ'];
  }
  if (letter >= '1250' && letter <= '125F') {
    return ['ቐ', 'ቑ', 'ቒ', 'ቓ', 'ቔ', 'ቕ', 'ቖ', 'ቘ', 'ቚ', 'ቛ', 'ቜ', 'ቝ'];
  }
  if (letter >= '1260' && letter <= '1267') {
    return ['በ', 'ቡ', 'ቢ', 'ባ', 'ቤ', 'ብ', 'ቦ', 'ቧ'];
  }
  if (letter >= '1268' && letter <= '126F') {
    return ['ቨ', 'ቩ', 'ቪ', 'ቫ', 'ቬ', 'ቭ', 'ቮ', 'ቯ'];
  }
  if (letter >= '1270' && letter <= '1277') {
    return ['ተ', 'ቱ', 'ቲ', 'ታ', 'ቴ', 'ት', 'ቶ', 'ቷ'];
  }
  if (letter >= '1278' && letter <= '127F') {
    return ['ቸ', 'ቹ', 'ቺ', 'ቻ', 'ቼ', 'ች', 'ቾ', 'ቿ'];
  }
  if (letter >= '1280' && letter <= '128F') {
    return ['ኀ', 'ኁ', 'ኂ', 'ኃ', 'ኄ', 'ኅ', 'ኆ', 'ኇ', 'ኈ', 'ኊ', 'ኋ', 'ኌ', 'ኍ'];
  }
  if (letter >= '1290' && letter <= '1297') {
    return ['ነ', 'ኑ', 'ኒ', 'ና', 'ኔ', 'ን', 'ኖ', 'ኗ'];
  }
  if (letter >= '1298' && letter <= '129F') {
    return ['ኘ', 'ኙ', 'ኚ', 'ኛ', 'ኜ', 'ኝ', 'ኞ', 'ኟ'];
  }
  if (letter >= '12A0' && letter <= '12A7') {
    return ['አ', 'ኡ', 'ኢ', 'ኣ', 'ኤ', 'እ', 'ኦ', 'ኧ'];
  }
  if (letter >= '12A8' && letter <= '12B5') {
    return ['ከ', 'ኩ', 'ኪ', 'ካ', 'ኬ', 'ክ', 'ኮ', 'ኯ', 'ኰ', 'ኲ', 'ኳ', 'ኴ', 'ኵ'];
  }
  if (letter >= '12B8' && letter <= '12C5') {
    return ['ኸ', 'ኹ', 'ኺ', 'ኻ', 'ኼ', 'ኽ', 'ኾ', 'ዀ', 'ዂ', 'ዃ', 'ዄ', 'ዅ'];
  }
  if (letter >= '12C8' && letter <= '12CF') {
    return ['ወ', 'ዉ', 'ዊ', 'ዋ', 'ዌ', 'ው', 'ዎ', 'ዏ'];
  }
  if (letter >= '12D0' && letter <= '12D7') {
    return ['ዐ', 'ዑ', 'ዒ', 'ዓ', 'ዔ', 'ዕ', 'ዖ'];
  }
  if (letter >= '12D8' && letter <= '12DF') {
    return ['ዘ', 'ዙ', 'ዚ', 'ዛ', 'ዜ', 'ዝ', 'ዞ', 'ዟ'];
  }
  if (letter >= '12E0' && letter <= '12E7') {
    return ['ዠ', 'ዡ', 'ዢ', 'ዣ', 'ዤ', 'ዥ', 'ዦ', 'ዧ'];
  }
  if (letter >= '12E8' && letter <= '12EF') {
    return ['የ', 'ዩ', 'ዪ', 'ያ', 'ዬ', 'ይ', 'ዮ', 'ዯ'];
  }
  if (letter >= '12F0' && letter <= '12FF') {
    return ['ደ', 'ዱ', 'ዲ', 'ዳ', 'ዴ', 'ድ', 'ዶ', 'ዷ', 'ዸ', 'ዹ', 'ዺ', 'ዻ', 'ዼ', 'ዽ', 'ዾ', 'ዿ'];
  }
  if (letter >= '1300' && letter <= '1307') {
    return ['ጀ', 'ጁ', 'ጂ', 'ጃ', 'ጄ', 'ጅ', 'ጆ', 'ጇ'];
  }
  if (letter >= '1308' && letter <= '1317') {
    return ['ገ', 'ጉ', 'ጊ', 'ጋ', 'ጌ', 'ግ', 'ጎ', 'ጏ', 'ጐ', 'ጒ', 'ጓ', 'ጔ', 'ጕ'];
  }
  if (letter >= '1318' && letter <= '131F') {
    return ['ጘ', 'ጙ', 'ጚ', 'ጛ', 'ጜ', 'ጝ', 'ጞ', 'ጟ'];
  }
  if (letter >= '1320' && letter <= '1327') {
    return ['ጠ', 'ጡ', 'ጢ', 'ጣ', 'ጤ', 'ጥ', 'ጦ', 'ጧ'];
  }
  if (letter >= '1328' && letter <= '132F') {
    return ['ጨ', 'ጩ', 'ጪ', 'ጫ', 'ጬ', 'ጭ', 'ጮ', 'ጯ'];
  }
  if (letter >= '1330' && letter <= '1337') {
    return ['ጰ', 'ጱ', 'ጲ', 'ጳ', 'ጴ', 'ጵ', 'ጶ', 'ጷ'];
  }
  if (letter >= '1338' && letter <= '133F') {
    return ['ጸ', 'ጹ', 'ጺ', 'ጻ', 'ጼ', 'ጽ', 'ጾ', 'ጿ'];
  }
  if (letter >= '1340' && letter <= '1347') {
    return ['ፀ', 'ፁ', 'ፂ', 'ፃ', 'ፄ', 'ፅ', 'ፆ', 'ፇ'];
  }
  if (letter >= '1348' && letter <= '134F') {
    return ['ፈ', 'ፉ', 'ፊ', 'ፋ', 'ፌ', 'ፍ', 'ፎ', 'ፏ'];
  }
  if (letter >= '1350' && letter <= '1357') {
    return ['ፐ', 'ፑ', 'ፒ', 'ፓ', 'ፔ', 'ፕ', 'ፖ', 'ፗ'];
  }
  return null;
}
